БИТУправление_медицинским_центром_демо/src/Catalogs/ФорматыФайловДляЗагрузкиДанных/ФорматыФайловДляЗагрузкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФорматыФайловДляЗагрузкиДанных</name>
  <attributes>
    <name>ОбластьПрименения</name>
    <type>
      <types>EnumRef.ОбластиПримененияФорматовФайловДляЗагрузкиДанных</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокКолонок</name>
    <attributes>
      <name>Колонка</name>
      <type>
        <types>EnumRef.КолонкиФайлаДляЗагрузкиДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКолонкиВФайле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Enums/КолонкиФайлаДляЗагрузкиДанных/КолонкиФайлаДляЗагрузкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КолонкиФайлаДляЗагрузкиДанных</name>
  <enumValues>
    <name>ФИО</name>
  </enumValues>
  <enumValues>
    <name>ДатаРождения</name>
  </enumValues>
  <enumValues>
    <name>Пол</name>
  </enumValues>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>ВредныеФакторыИУсловия</name>
  </enumValues>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>Профессия</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаРаботы</name>
  </enumValues>
  <enumValues>
    <name>СрокСтажа</name>
  </enumValues>
  <enumValues>
    <name>СНИЛС</name>
  </enumValues>
  <enumValues>
    <name>ПолисНомер</name>
  </enumValues>
  <enumValues>
    <name>ПолисСерия</name>
  </enumValues>
  <enumValues>
    <name>ПолисДействуетС</name>
  </enumValues>
  <enumValues>
    <name>ПолисСрокДействия</name>
  </enumValues>
  <enumValues>
    <name>ВидДУЛ</name>
  </enumValues>
  <enumValues>
    <name>СерияДУЛ</name>
  </enumValues>
  <enumValues>
    <name>НомерДУЛ</name>
  </enumValues>
  <enumValues>
    <name>ДатаВыдачиДУЛ</name>
  </enumValues>
  <enumValues>
    <name>КемВыданДУЛ</name>
  </enumValues>
  <enumValues>
    <name>ТипМедосмотра</name>
  </enumValues>
  <enumValues>
    <name>ИНН</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ОбластиПримененияФорматовФайловДляЗагрузкиДанных/ОбластиПримененияФорматовФайловДляЗагрузкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбластиПримененияФорматовФайловДляЗагрузкиДанных</name>
  <enumValues>
    <name>Медосмотры</name>
  </enumValues>
  <enumValues>
    <name>Полисы</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ФорматыФайловДляЗагрузкиДанных/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФорматыФайловДляЗагрузкиДанныхСписокКолонок.Колонка,
	|	ФорматыФайловДляЗагрузкиДанныхСписокКолонок.НомерСтроки,
	|	ФорматыФайловДляЗагрузкиДанныхСписокКолонок.ИмяКолонкиВФайле
	|ПОМЕСТИТЬ ВыбранныеКолонки
	|ИЗ
	|	Справочник.ФорматыФайловДляЗагрузкиДанных.СписокКолонок КАК ФорматыФайловДляЗагрузкиДанныхСписокКолонок
	|ГДЕ
	|	ФорматыФайловДляЗагрузкиДанныхСписокКолонок.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КолонкиФайлаДляЗагрузкиДанных.Ссылка КАК Колонка,
	|	ВЫБОР
	|		КОГДА КолонкиФайлаДляЗагрузкиДанных.Ссылка = ЗНАЧЕНИЕ(Перечисление.КолонкиФайлаДляЗагрузкиДанных.ФИО)
	|				ИЛИ КолонкиФайлаДляЗагрузкиДанных.Ссылка = ЗНАЧЕНИЕ(Перечисление.КолонкиФайлаДляЗагрузкиДанных.ДатаРождения)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВыбранныеКолонки.Колонка ЕСТЬ NULL 
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	КОНЕЦ КАК Установлена,
	|	ВЫБОР
	|		КОГДА ВыбранныеКолонки.Колонка ЕСТЬ NULL 
	|			ТОГДА КолонкиФайлаДляЗагрузкиДанных.Порядок
	|		ИНАЧЕ ВыбранныеКолонки.НомерСтроки
	|	КОНЕЦ КАК Порядок,
	|	ВЫБОР
	|		КОГДА ВыбранныеКолонки.ИмяКолонкиВФайле ЕСТЬ NULL 
	|				ИЛИ ВыбранныеКолонки.ИмяКолонкиВФайле = """"
	|			ТОГДА КолонкиФайлаДляЗагрузкиДанных.Ссылка
	|		ИНАЧЕ ВыбранныеКолонки.ИмяКолонкиВФайле
	|	КОНЕЦ КАК ИмяКолонкиВФайле
	|ИЗ
	|	Перечисление.КолонкиФайлаДляЗагрузкиДанных КАК КолонкиФайлаДляЗагрузкиДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыбранныеКолонки КАК ВыбранныеКолонки
	|		ПО (ВыбранныеКолонки.Колонка = КолонкиФайлаДляЗагрузкиДанных.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Установлена УБЫВ,
	|	Порядок";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	СписокКолонок.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Если Объект.Ссылка.Пустая()
		И Объект.ОбластьПрименения = Перечисления.ОбластиПримененияФорматовФайловДляЗагрузкиДанных.Медосмотры
	Тогда
		КолонкаВредныеФакторы = СписокКолонок.НайтиСтроки(Новый Структура("Колонка", Перечисления.КолонкиФайлаДляЗагрузкиДанных.ВредныеФакторыИУсловия));
		Если КолонкаВредныеФакторы.Количество() <> 0 Тогда
			КолонкаВредныеФакторы[0].Установлена = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.СписокКолонок.Очистить();
	Для Каждого СтрокаКолонка Из СписокКолонок Цикл
		Если СтрокаКолонка.Установлена Тогда
			ЗаполнитьЗначенияСвойств(ТекущийОбъект.СписокКолонок.Добавить(), СтрокаКолонка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокКолонокУстановленаПриИзменении(Элемент)
	
	ТекДанные = Элементы.СписокКолонок.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.Колонка = ПредопределенноеЗначение("Перечисление.КолонкиФайлаДляЗагрузкиДанных.ФИО") Или
		ТекДанные.Колонка = ПредопределенноеЗначение("Перечисление.КолонкиФайлаДляЗагрузкиДанных.ДатаРождения") Тогда
		ТекДанные.Установлена = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
